# CLI tools
brew "1password-cli" # Activate integration in app (https://developer.1password.com/docs/cli/get-started/#step-2-turn-on-the-1password-desktop-app-integration)
brew "awscli" # run `op plugin init aws` to link with 1Password
brew "fnm" # run `fnm env` and `fnm install --lts`
brew "gh" # gh auth login
brew "git"
brew "http-server"
brew "infisical"
brew "jq"
brew "mas"
brew "mole" # https://github.com/tw93/Mole
brew "pnpm"
brew "vercel-cli"
# brew "bun"
# brew "postgresql@16"

# Applications (Cask)
cask "1password"
cask "android-studio"
cask "claude"
cask "claude-code"
cask "cursor" # Or "visual-studio-code"
cask "figma"
cask "google-chrome"
cask "maccy"
cask "obsidian"
cask "orbstack"
cask "postman"
# cask "another-redis-desktop-manager"
# cask "autofirma" # Requires Rosetta
# cask "calibre"
# cask "logi-options+"
# cask "ngrok"
# cask "notion-calendar"
# cask "pgadmin4"
# cask "slack"
# cask "spotify"
# cask "stremio"
# cask "vlc"
# cask "windscribe"
# cask "zoom"

# App Store apps (requires 'mas' to be installed via Homebrew)
mas "Amphetamine", id: 937984704
mas "Magnet", id: 441258766
mas "WhatsApp", id: 310633997
mas "Xcode", id: 497799835
# mas "Aiko", id: 1672085276

# Circus project dependencies
# brew "maven"
